{
  "format": "layers-model",
  "generatedBy": null,
  "convertedBy": "TensorFlow.js Converter v2.3.0",
  "modelTopology": {
    "keras_version": "2.1.4",
    "model_config": {
      "class_name": "Model",
      "config": {
        "layers": [
          {
            "class_name": "InputLayer",
            "inbound_nodes": [],
            "config": {
              "dtype": "float32",
              "batch_input_shape": [ null, 224, 224, 3 ],
              "name": "input_1",
              "sparse": false
            },
            "name": "input_1"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "input_1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv1",
              "kernel_constraint": null,
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [ 2, 2 ],
              "dilation_rate": [ 1, 1 ],
              "kernel_regularizer": null,
              "filters": 8,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 3, 3 ]
            },
            "name": "conv1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv1_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv1_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv1_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv1_relu"
            },
            "name": "conv1_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [
              [
                [
                  "conv1_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "padding": "same",
              "depth_multiplier": 1,
              "name": "conv_dw_1",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "depthwise_constraint": null,
              "strides": [ 1, 1 ],
              "dilation_rate": [ 1, 1 ],
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 3, 3 ]
            },
            "name": "conv_dw_1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_dw_1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_dw_1_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_dw_1_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_dw_1_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_dw_1_relu"
            },
            "name": "conv_dw_1_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "conv_dw_1_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_1",
              "kernel_constraint": null,
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [ 1, 1 ],
              "dilation_rate": [ 1, 1 ],
              "kernel_regularizer": null,
              "filters": 16,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 1, 1 ]
            },
            "name": "conv_pw_1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_pw_1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_pw_1_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_pw_1_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_pw_1_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_pw_1_relu"
            },
            "name": "conv_pw_1_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [
              [
                [
                  "conv_pw_1_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "padding": "same",
              "depth_multiplier": 1,
              "name": "conv_dw_2",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "depthwise_constraint": null,
              "strides": [ 2, 2 ],
              "dilation_rate": [ 1, 1 ],
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 3, 3 ]
            },
            "name": "conv_dw_2"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_dw_2",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_dw_2_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_dw_2_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_dw_2_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_dw_2_relu"
            },
            "name": "conv_dw_2_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "conv_dw_2_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_2",
              "kernel_constraint": null,
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [ 1, 1 ],
              "dilation_rate": [ 1, 1 ],
              "kernel_regularizer": null,
              "filters": 32,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 1, 1 ]
            },
            "name": "conv_pw_2"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_pw_2",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_pw_2_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_pw_2_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_pw_2_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_pw_2_relu"
            },
            "name": "conv_pw_2_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [
              [
                [
                  "conv_pw_2_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "padding": "same",
              "depth_multiplier": 1,
              "name": "conv_dw_3",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "depthwise_constraint": null,
              "strides": [ 1, 1 ],
              "dilation_rate": [ 1, 1 ],
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 3, 3 ]
            },
            "name": "conv_dw_3"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_dw_3",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_dw_3_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_dw_3_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_dw_3_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_dw_3_relu"
            },
            "name": "conv_dw_3_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "conv_dw_3_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_3",
              "kernel_constraint": null,
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [ 1, 1 ],
              "dilation_rate": [ 1, 1 ],
              "kernel_regularizer": null,
              "filters": 32,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 1, 1 ]
            },
            "name": "conv_pw_3"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_pw_3",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_pw_3_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_pw_3_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_pw_3_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_pw_3_relu"
            },
            "name": "conv_pw_3_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [
              [
                [
                  "conv_pw_3_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "padding": "same",
              "depth_multiplier": 1,
              "name": "conv_dw_4",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "depthwise_constraint": null,
              "strides": [ 2, 2 ],
              "dilation_rate": [ 1, 1 ],
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 3, 3 ]
            },
            "name": "conv_dw_4"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_dw_4",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_dw_4_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_dw_4_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_dw_4_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_dw_4_relu"
            },
            "name": "conv_dw_4_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "conv_dw_4_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_4",
              "kernel_constraint": null,
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [ 1, 1 ],
              "dilation_rate": [ 1, 1 ],
              "kernel_regularizer": null,
              "filters": 64,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 1, 1 ]
            },
            "name": "conv_pw_4"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_pw_4",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_pw_4_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_pw_4_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_pw_4_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_pw_4_relu"
            },
            "name": "conv_pw_4_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [
              [
                [
                  "conv_pw_4_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "padding": "same",
              "depth_multiplier": 1,
              "name": "conv_dw_5",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "depthwise_constraint": null,
              "strides": [ 1, 1 ],
              "dilation_rate": [ 1, 1 ],
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 3, 3 ]
            },
            "name": "conv_dw_5"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_dw_5",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_dw_5_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_dw_5_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_dw_5_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_dw_5_relu"
            },
            "name": "conv_dw_5_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "conv_dw_5_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_5",
              "kernel_constraint": null,
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [ 1, 1 ],
              "dilation_rate": [ 1, 1 ],
              "kernel_regularizer": null,
              "filters": 64,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 1, 1 ]
            },
            "name": "conv_pw_5"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_pw_5",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_pw_5_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_pw_5_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_pw_5_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_pw_5_relu"
            },
            "name": "conv_pw_5_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [
              [
                [
                  "conv_pw_5_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "padding": "same",
              "depth_multiplier": 1,
              "name": "conv_dw_6",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "depthwise_constraint": null,
              "strides": [ 2, 2 ],
              "dilation_rate": [ 1, 1 ],
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 3, 3 ]
            },
            "name": "conv_dw_6"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_dw_6",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_dw_6_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_dw_6_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_dw_6_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_dw_6_relu"
            },
            "name": "conv_dw_6_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "conv_dw_6_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_6",
              "kernel_constraint": null,
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [ 1, 1 ],
              "dilation_rate": [ 1, 1 ],
              "kernel_regularizer": null,
              "filters": 128,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 1, 1 ]
            },
            "name": "conv_pw_6"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_pw_6",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_pw_6_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_pw_6_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_pw_6_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_pw_6_relu"
            },
            "name": "conv_pw_6_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [
              [
                [
                  "conv_pw_6_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "padding": "same",
              "depth_multiplier": 1,
              "name": "conv_dw_7",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "depthwise_constraint": null,
              "strides": [ 1, 1 ],
              "dilation_rate": [ 1, 1 ],
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 3, 3 ]
            },
            "name": "conv_dw_7"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_dw_7",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_dw_7_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_dw_7_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_dw_7_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_dw_7_relu"
            },
            "name": "conv_dw_7_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "conv_dw_7_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_7",
              "kernel_constraint": null,
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [ 1, 1 ],
              "dilation_rate": [ 1, 1 ],
              "kernel_regularizer": null,
              "filters": 128,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 1, 1 ]
            },
            "name": "conv_pw_7"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_pw_7",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_pw_7_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_pw_7_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_pw_7_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_pw_7_relu"
            },
            "name": "conv_pw_7_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [
              [
                [
                  "conv_pw_7_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "padding": "same",
              "depth_multiplier": 1,
              "name": "conv_dw_8",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "depthwise_constraint": null,
              "strides": [ 1, 1 ],
              "dilation_rate": [ 1, 1 ],
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [ 3, 3 ]
            },
            "name": "conv_dw_8"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "conv_dw_8",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "conv_dw_8_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "conv_dw_8_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "conv_dw_8_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu6",
              "trainable": true,
              "name": "conv_dw_8_relu"
            },
            "name": "conv_dw_8_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "conv_dw_8_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_8",
              "kernel_constraint": null,
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
